{
  "title": "Guided Tour",
  "progress": {
    "step": "Step {{current}} of {{total}}"
  },
  "steps": {
    "welcome": {
      "title": "Welcome",
      "description": "Welcome to the QZPay Playground! This guided tour will walk you through creating your first billing setup."
    },
    "setup": {
      "title": "Setup",
      "description": "First, let's configure your payment mode. Choose 'Mock' for testing without real payments, or connect a real provider."
    },
    "plans": {
      "title": "Create Plans",
      "description": "Plans define the different subscription tiers you offer. Create at least one plan to get started."
    },
    "prices": {
      "title": "Add Prices",
      "description": "Prices define how much each plan costs. Add monthly or yearly pricing to your plans."
    },
    "customers": {
      "title": "Create Customers",
      "description": "Customers are the users who will subscribe to your plans. Create a test customer to continue."
    },
    "subscriptions": {
      "title": "Create Subscription",
      "description": "Subscribe your test customer to a plan. This creates an active subscription relationship."
    },
    "actions": {
      "title": "Try Actions",
      "description": "Now try some subscription actions like pausing, resuming, or canceling. See how the system responds."
    },
    "events": {
      "title": "View Events",
      "description": "Every action generates events. Check the Events view to see the timeline of what happened."
    },
    "components": {
      "title": "React Components",
      "description": "Explore the pre-built React components from @qazuor/qzpay-react that you can use in your app."
    },
    "complete": {
      "title": "Tour Complete!",
      "description": "Congratulations! You've completed the guided tour and learned the basics of QZPay."
    }
  },
  "tips": {
    "label": "Tip",
    "setup": "Use Mock mode to test without real payments. You can switch to Stripe or MercadoPago later.",
    "plans": "Start with 2-3 tiers like Free, Pro, and Enterprise. You can always add more later.",
    "prices": "Consider offering both monthly and yearly pricing with a discount for annual subscriptions.",
    "customers": "In production, customers are created automatically when users sign up.",
    "subscriptions": "Subscriptions track the ongoing relationship between a customer and a plan.",
    "actions": "Try canceling a subscription to see how the system handles it gracefully.",
    "events": "Events are useful for debugging and building audit trails in production.",
    "components": "These components work with any billing instance and can be styled to match your app."
  },
  "controls": {
    "start": "Start Tour",
    "next": "Next",
    "previous": "Previous",
    "skip": "Skip",
    "exit": "Exit Tour",
    "finish": "Finish"
  },
  "complete": {
    "message": "You're now ready to build amazing billing experiences with QZPay! Explore the playground to learn more."
  },
  "welcome": {
    "startTour": "Start Guided Tour",
    "resumeTour": "Resume Tour",
    "tourDescription": "New to QZPay? Take a guided tour to learn the basics."
  }
}
